#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/actions-hero/actions-hero/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/actions-hero/actions-hero

To view this run in a browser, visit:
https://app.terraform.io/app/metaroon/staging/runs/run-Ln7BnYruW5jAE7zP

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
random_string.random: Refreshing state... [id=6wlcltl5]
google_compute_project_metadata.ssh_keys: Refreshing state... [id=academic-matter-404418]
google_dns_managed_zone.my_zone: Refreshing state... [id=projects/academic-matter-404418/managedZones/pr-staging-zone]
google_compute_instance.staging_pr_demo: Refreshing state... [id=projects/academic-matter-404418/zones/us-central1-a/instances/staging-pr-6wlcltl5]
google_dns_record_set.my_instance_dns: Refreshing state... [id=projects/academic-matter-404418/managedZones/pr-staging-zone/rrsets/staging-pr-6wlcltl5.wisdomdemo.com./A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_firewall.allow_http will be created
  + resource "google_compute_firewall" "allow_http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-http"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "staging-pr-demo",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.allow_https will be created
  + resource "google_compute_firewall" "allow_https" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-https"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "staging-pr-demo",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.staging_pr_demo will be updated in-place
  ~ resource "google_compute_instance" "staging_pr_demo" {
        id                   = "projects/academic-matter-404418/zones/us-central1-a/instances/staging-pr-6wlcltl5"
      ~ metadata             = {
          - "allow-http"     = "true" -> null
          - "allow-https"    = "true" -> null
            # (2 unchanged elements hidden)
        }
        name                 = "staging-pr-6wlcltl5"
        tags                 = [
            "staging-pr-demo",
        ]
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @stoXmod, Action: `workflow_dispatch`*